# IntegerRange Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IntegerRange Members
IntegerRange Class Methods Properties See Also
---
The IntegerRange type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the IntegerRange |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| High | The upper limit of the range |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Low | The lower limit of the range |

# See Also
IntegerRange Class
Autodesk.Revit.DB Namespace